In [1]:
import pandas as pd

In [2]:
india_weather =pd.DataFrame ({
    "city": ["mumbai", "delhi","bangalore"],
    "temperature": [32,45,38],
    "humidity": [80,68,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        68
2  bangalore           38        78

In [3]:
usa_weather =pd.DataFrame ({
    "city": ["new york", "chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68,65,35]
})
usa_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        35

In [4]:
df=pd.concat([india_weather, usa_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        68
2  bangalore           38        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        35

In [5]:
df=pd.concat([india_weather, usa_weather],  keys=["india", "usa"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        68
      2  bangalore           38        78
usa   0   new york           21        68
      1    chicago           14        65
      2    orlando           35        35

In [6]:
df.loc["usa"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        35

In [7]:
temperature_df= pd.DataFrame ({
    "city": ["mumbai", "delhi","bangalore"],
    "temperature": [32,45,38],
},index = [0,1,2])
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           38

In [8]:
windspeed_df= pd.DataFrame ({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12]
},index= [1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [9]:
df=pd.concat ([temperature_df,windspeed_df], axis = 1)
df

        city  temperature    city  windspeed
0     mumbai           32  mumbai       12.0
1      delhi           45   delhi        7.0
2  bangalore           38     NaN        NaN

In [10]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           38

In [11]:
s = pd.Series(["Humid", "Dry", "Rain"], name = "event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [14]:
df=pd.concat ([temperature_df,s], axis = 1)
df

        city  temperature  event
0     mumbai           32  Humid
1      delhi           45    Dry
2  bangalore           38   Rain